	////////////////////////
	//     2.5.2.41446   //
	////////////////////////

	// base address
	static inline uintptr_t Base = reinterpret_cast<uintptr_t>(GetModuleHandle(NULL));

	//Lua
	inline static uintptr_t lua_pushnumber = Base + 0x511E00;
	inline static uintptr_t lua_pushboolean = Base + 0x511E00;

	// framescript
	static inline uintptr_t FrameScriptRegister = 0x08C7A70;	
	static inline uintptr_t FrameScript_RegisterFunctionNamespaceWithCount = 0x8C79C0;

	// Pointers
	static inline uintptr_t CGGameUI_s_inWorld = Base + 0x30C2F24; //   NotInitialized = 0, LoadingScreen1 = 3, LoadingScreen2 = 2, InGame = 4
	static inline uintptr_t IsPlayerInWorld = Base + 0x30C2F24;// Script_IsPlayerInWorld
	static inline uintptr_t LoadingScreen = Base + 0x00; // good //Reversed From Script_CanLogIn to CGlueMgr__CanLogIn

	// object manager
	static inline uintptr_t ClntObjMgrEnumVisibleObjectsPtr = Base + 0x13E3EB0;
	static inline uintptr_t ClntObjMgrGetMapId = Base + 0x13E8680;
	static inline uintptr_t ClntObjMgrIsValid = Base + 0x13E8DF0;

	//CTM         
	static inline uintptr_t OnTerrainClick = 0x161F1D0; // CGGameUI::OnTerrainClick. From time to time Clicks out of bound?
	static inline uintptr_t ClickToMove = 0x1251570; //
	static inline uintptr_t FaceTo = 0x12512E0;

	// pointers
	static inline uintptr_t InvalidPtrCheckMin = Base + 0x2E416C0;
	static inline uintptr_t InvalidPtrCheckMax = Base + 0x2E416C8;
	static inline uintptr_t HardwareEventPtr = Base + 0x2E1AE78;

MakeNameEx(0x1817FC0, "Script_TaxiIsDirectFlight", SN_NOWARN)
MakeNameEx(0x1817CC0, "Script_TaxiNodeCost", SN_NOWARN)
MakeNameEx(0x1817DC0, "Script_TaxiNodeGetType", SN_NOWARN)
MakeNameEx(0x1817B60, "Script_TaxiNodeName", SN_NOWARN)
MakeNameEx(0x1817C20, "Script_TaxiNodePosition", SN_NOWARN)
MakeNameEx(0x26A9D0, "Script_TaxiRequestEarlyLanding", SN_NOWARN)
MakeNameEx(0x15F26B0, "Script_TimeoutResurrect", SN_NOWARN)
MakeNameEx(0x20C420, "Script_ToggleAnimKitDisplay", SN_NOWARN)
MakeNameEx(0x25CD70, "Script_ToggleAutoRun", SN_NOWARN)
MakeNameEx(0x20C420, "Script_ToggleDebugAIDisplay", SN_NOWARN)
MakeNameEx(0x15EAE10, "Script_TogglePVP", SN_NOWARN)
MakeNameEx(0x172DC20, "Script_TogglePetAutocast", SN_NOWARN)
MakeNameEx(0x25C1A0, "Script_ToggleRun", SN_NOWARN)
MakeNameEx(0x15EBDB0, "Script_ToggleSelfHighlight", SN_NOWARN)
MakeNameEx(0x15EFD80, "Script_ToggleSheath", SN_NOWARN)
MakeNameEx(0x167C110, "Script_ToggleSpellAutocast", SN_NOWARN)
MakeNameEx(0x26C780, "Script_ToggleWindowed", SN_NOWARN)
MakeNameEx(0x16B2D10, "Script_TriggerTutorial", SN_NOWARN)
MakeNameEx(0x18C0E60, "Script_TurnInArenaPetition", SN_NOWARN)
MakeNameEx(0x18C0DC0, "Script_TurnInGuildCharter", SN_NOWARN)
MakeNameEx(0x25F820, "Script_TurnLeftStart", SN_NOWARN)
MakeNameEx(0x25FE20, "Script_TurnLeftStop", SN_NOWARN)
MakeNameEx(0x264080, "Script_TurnOrActionStart", SN_NOWARN)
MakeNameEx(0x264C00, "Script_TurnOrActionStop", SN_NOWARN)
MakeNameEx(0x260420, "Script_TurnRightStart", SN_NOWARN)
MakeNameEx(0x260A20, "Script_TurnRightStop", SN_NOWARN)
MakeNameEx(0x959020, "Script_UndeleteCharacter", SN_NOWARN)
MakeNameEx(0x16E7620, "Script_UninviteUnit", SN_NOWARN)
MakeNameEx(0x18508F0, "Script_UnitHasIncomingResurrection", SN_NOWARN)
MakeNameEx(0x16ECFB0, "Script_UnitInOtherParty", SN_NOWARN)
MakeNameEx(0x16E6880, "Script_UnitIsGroupAssistant", SN_NOWARN)
MakeNameEx(0x16E6660, "Script_UnitIsGroupLeader", SN_NOWARN)
MakeNameEx(0x16E6770, "Script_UnitLeadsAnyGroup", SN_NOWARN)
MakeNameEx(0x14FB240, "Script_UnmuteSoundFile", SN_NOWARN)
MakeNameEx(0x18163A0, "Script_UnstablePet", SN_NOWARN)
MakeNameEx(0x15E3520, "Script_UpdateAddOnCPUUsage", SN_NOWARN)
MakeNameEx(0x15E3410, "Script_UpdateAddOnMemoryUsage", SN_NOWARN)
MakeNameEx(0x17ECDD0, "Script_UpdateInventoryAlertStatus", SN_NOWARN)
MakeNameEx(0x9590E0, "Script_UpdateSelectionCustomizationScene", SN_NOWARN)
MakeNameEx(0x973150, "Script_UpdateWindow", SN_NOWARN)
MakeNameEx(0x973150, "Script_UpdateWindow", SN_NOWARN)
MakeNameEx(0x17A3E50, "Script_UseAction", SN_NOWARN)
MakeNameEx(0x183FE30, "Script_UseContainerItem", SN_NOWARN)
MakeNameEx(0x1844940, "Script_UseHearthstone", SN_NOWARN)
MakeNameEx(0x17EC330, "Script_UseInventoryItem", SN_NOWARN)
MakeNameEx(0x15E3C80, "Script_UseItemByName", SN_NOWARN)
MakeNameEx(0x9745B0, "Script_VisitPromotionURL", SN_NOWARN)
MakeNameEx(0x1704E50, "Script_WarGameRespond", SN_NOWARN)
MakeNameEx(0x9746B0, "Script_WasScreenFirstDisplayed", SN_NOWARN)
MakeNameEx(0x187F7C0, "Script_WithdrawGuildBankMoney", SN_NOWARN)


//CGObject struct
class WObject
{
public:
	char pad_0008[8]; //0x0008
	class UnitField* sUnitField; //0x0010
	char pad_0018[8]; //0x0018
	TypeId Type; //0x0020
	char pad_0021[55]; //0x0021
	WGuid Guid; //0x0058
	char pad_0060[5464]; //0x0060
	Vector3 GetUnitPositionModify; //0x15B8
	char pad_15C4[44]; //0x15C4
	Vector3 anchor_position; //0x15F8
	float anchor_facing; //0x1604
	float anchor_pitch; //0x1608
	uint32_t MoveTime; //?? 0x160C
	C3Vector direction; //0x1610
	Vector2 direction_2d; //0x161C
	float unk01;
	float unk02;
	float unk03;
	uint32_t StopFall; // 0x1628
	float fall_start_elev_1; //DC
	float CurrentSpeed; //0x1638
	float WalkSpeed;    //0x163C
	float RunForwardSpeed; //0x1640
	float RunBackwardsSpeed; //0x1644
	float SwimmingSpeed; //0x1648
	float SwimBackwardsSpeed; //0x164C
	float FlyForwardSpeed; //0x1650
	float FlyBackwardsSpeed2; //0x1654
	float Player_rotationspeed; //0x1658
	char pad_165C[8]; //0x165C
	float StartofJumpHeight; //0x1664  Sets Starting jumpheight will dc you after a few ms...
	char pad_1668[32]; //0x1668
	uint64_t unk04; //0x1688
	float unk05; //0x1690    
	float Flagunk; //0x1694  Default value: 0.398, Falls through ground on: 0 <=.  Increasing value will bounce back the character. Test at high alt...
	uint32_t MovementFlags; //0x1698 MovementFlags 
	char pad_169C[460]; //0x169C
	float Player_scale; //0x1868
	char pad_186C[2104]; //0x186C

	virtual ~WObject()
}

//My unitField struct
class UnitField
{
public:
	char pad_0000[20]; //0x0000
	DWORD DynamicFlags; //0x0014
	char pad_0018[36]; //0x0018
	uint32_t GameObjectDisPlayID; //0x003C
	uint32_t GameObjectFlag; //0x0040
	char pad_0044[8]; //0x0044
	uint8_t critter; //0x004C
	char pad_004D[15]; //0x004D
	uint8_t summonedBy; //0x005C
	char pad_005D[63]; //0x005D
	WGuid Target; //0x009C
	char pad_00A4[20]; //0x00A4
	uint32_t SpellID; //0x00C4
	uint32_t SpellDuration; //0x00C8
	char pad_00CC[4]; //0x00CC  5
	uint8_t Race; //0x00D0
	uint8_t ClassID; //0x00D1
	uint8_t PlayerClassID; //0x00D2
	uint8_t Sex; //0x00D3
	uint32_t DisplayPower; //0x00D4
	uint32_t OverrideDisplayPowerID; //0x00D8
	uint32_t Health; //0x00DC
	char pad_00E0[4]; //0x00E0
	uint32_t Energy; //0x00E4
	char pad_00E8[20]; //0x00E8
	uint32_t MaxHealth; //0x00FC
	char pad_0100[4]; //0x0100
	uint32_t MaxEnergy; //0x0104
	char pad_0108[44]; //0x0108
	uint32_t N000004A4; //0x0134
	char pad_0138[32]; //0x0138
	uint64_t RaceID; //0x0158
	char pad_0160[20]; //0x0160
	DWORD UnitFlag1; //0x0174
	DWORD UnitFlag2; //0x0178
	DWORD UnitFlag3; //0x017C
	char pad_0180[124]; //0x0180
	uint32_t Strength; //0x01FC                   
	uint32_t Agility; //0x0200
	uint32_t Stamina; //0x0204
	uint32_t Intelect; //0x0208
	uint32_t Spirit; //0x020C
	char pad_0210[40]; //0x0210
	uint32_t Armor; //0x0238
	uint32_t resistance_fire; //0x023C
	uint32_t resistance_arcane; //0x0240
	uint32_t resistance_nature; //0x0244
	uint32_t resistance_frost; //0x0248
	uint32_t resistance_shadow; //0x024C
	char pad_0250[328]; //0x0250
	uint32_t IsPlayerDead; //0x0398 Changes the skybox to blue
	char pad_039C[1476]; //0x039C
	float Drunk; //0x0960  Set to 0/255
	char pad_0964[209004]; //0x0964

	bool hasTarget(WGuid t)
	{
		if (this->Target == t)
			return true;
		else
			return false;
	}

	//0x01BE // Stealth walking Animation
}; //Size: 0x339D0
static_assert(sizeof(UnitField) == 0x339D0);